unit Materials;

interface

{// Марка стали для шестерни и колеса
const markaa: array[1..24] of String =
  ('12ХН2 ГОСТ 4543-71',
   '12ХН3А ГОСТ 4543-71',
   '12Х2Н4А ГОСТ 4543-71',
   '15ХГНТА ГОСТ 4543-71',
   '18ХГТ ГОСТ 4543-71',
   '18Х2Н4ВА ГОСТ 4543-71',
   '20Х ГОСТ 4543-71',
   '20ХН ГОСТ 4543-71',
   '20ХН2М ГОСТ 4543-71',
   '20ХН3А ГОСТ 4543-71',
   '20Х2Н4А ГОСТ 4543-71',
   '20ХГР ГОСТ 4543-71',
   '25ХГТМА ГОСТ 4543-71',
   '30ХГТ ГОСТ 4543-71',
   '25ХГТ ГОСТ 4543-71',
   '30ХГТ ГОСТ 4543-71',
   '35ХМ ГОСТ 4543-71',
   '40 ГОСТ 1050-74',
   '40Х ГОСТ 4543-71',
   '40ХН ГОСТ 4543-71',
   '40ХФА ГОСТ 4543-71',
   '40ХН2МА ГОСТ 4543-71',
   '45 ГОСТ 1050-74',
   '50ХН ГОСТ 1050-74');}

// Термообработка зуба шестерни и колеса, номер
const Termobra: array[0..8] of String =
  ('AUTO',
   'Улучшение',
   'Нормализация',
   'Объемная закалка',
   'Эакалка ТВЧ',
   'Цементация',
   'Нитроцементация',
   'Азотирование',
   'Отжиг');

// Шероховатость боковой поверхности зуба шестерни и колеса
const Raa: array[0..2] of String =
  ('1.6','3.2','6.3');

// Тип зубьев колес
const Tipza: array[0..2] of String =
  ('автовыбор',
   'прямые',
   'косые');

// Способ получения заготовки шестерни и колеса
const Zagotowkaa: array[1..4] of String =
  ('для поковок',
   'для штамповок',
   'для проката',
   'для отливок');

// Осевая форма зуба
const Formaa: array[0..2] of String =
  ('понижающуюся (I)',
   'понижающуюся (II)',
   'равновысокую (III)');

{// Предел текучести материала шестерни и колеса
const Sigma_ta: array[1..20] of Integer =
  (330,340,360,400,450,460,600,630,650,700,
   750,760,800,850,900,920,1000,1100,1200,1300);

// Предел выносливости по изгибу для шестерни и колеса
const Sigma_Flim0a: array[1..13] of Integer =
  (240,330,420,460,480,500,580,680,750,780,820,950,1000);

// Предельное напряжение для шестерни и колеса
const Sigma_Fst0a: array[1..8] of Integer =
  (1200,1500,1800,2000,2200,2250,2500,2800);

// Коэффициент выносливости по изгибу для шестерни и колеса
const S_Fa: array[1..2] of Extended =
  (1.55,1.70);}

const
  // Допустимое значение мощности на ведущем валу, кВт
  P1Max: extended = 300;
  P1Min: extended = 0.2;
  // Допустимое значение передаточного числа
  UMax: extended = 8;
  UMin: extended = 1;
  // Допустимое значение частоты вращения ведущего шкива, об/мин
  N1Max: extended = 5000;
  N1Min: extended = 1;
  // Расчетный ресурс передачи
  LhMax: Integer = 100000;
  LhMin: Integer = 10;
  // Твердость сердцевины зуба шестерни по Роквеллу
  H_HRcs1max: Integer = 68;
  H_HRcs1min: Integer = 35;
  // Твердость сердцевины зуба колеса по Роквеллу
  H_HRcs2max: Integer = 68;
  H_HRcs2min: Integer = 35;
  // Твердость поверхности зуба шестерни по Роквеллу
  H_HRcp1max: Integer = 68;
  H_HRcp1min: Integer = 35;
  // Твердость поверхности зуба колеса по Роквеллу
  H_HRcp2max: Integer = 68;
  H_HRcp2min: Integer = 35;
  // Твердость сердцевины зуба шестерни по Бринелю
  H_HBs1max: Integer = 350;
  H_HBs1min: Integer = 0;
  // Твердость сердцевины зуба колеса по Бринелю
  H_HBs2max: Integer = 350;
  H_HBs2min: Integer = 0;
  // Твердость поверхности зуба шестерни по Бринелю
  H_HBp1max: Integer = 350;
  H_HBp1min: Integer = 0;
  // Твердость поверхности зуба колеса по Бринелю
  H_HBp2max: Integer = 350;
  H_HBp2min: Integer = 0;
  // Номер схемы расположения колес
  Nom_sxmin: Integer = 1;
  Nom_sxmax: Integer = 4;

const markaa:array[1..50] of string = (
'12ХН2 ГОСТ 4543-71',
'12ХН3А ГОСТ 4543-71',
'12Х2Н4А ГОСТ 4543-71',
'15ХГНТА ГОСТ 4543-71',
'18ХГТ ГОСТ 4543-71',
'18ХГТ ГОСТ 4543-71' ,
'18Х2Н4ВА ГОСТ 4543-71',
'18Х2Н4ВА ГОСТ 4543-71',
'20Х ГОСТ 4543-71',
'20ХН ГОСТ 4543-71',
'20ХН2М ГОСТ 4543-71'   ,
'20ХН3А ГОСТ 4543-71'   ,
'20ХН3А ГОСТ 4543-71'   ,
'20Х2Н4А ГОСТ 4543-71'  ,
'20Х2Н4А ГОСТ 4543-71'  ,
'20ХГР ГОСТ 4543-71'    ,
'25ХГТМА ГОСТ 4543-71' ,
'30ХГТ ГОСТ 4543-71'    ,
'30ХГТ ГОСТ 4543-71'   ,
'25ХГМ ГОСТ 4543-71'    ,
'25ХГТ ГОСТ 4543-71'    ,
'30ХГТ ГОСТ 4543-71'    ,
'35ХМ ГОСТ 4543-71'     ,
'35ХМ ГОСТ 4543-71'     ,
'40 ГОСТ 1050-74'       ,
'40 ГОСТ 1050-74'       ,
'40Х ГОСТ 4543-71'      ,
'40Х ГОСТ 4543-71'      ,
'40Х ГОСТ 4543-71'      ,
'40Х ГОСТ 4543-71'      ,
'40Х ГОСТ 4543-71'      ,
'40Х ГОСТ 4543-71'      ,
'40ХН ГОСТ 4543-71'     ,
'40ХН ГОСТ 4543-71'     ,
'40ХН ГОСТ 4543-71'     ,
'40ХН ГОСТ 4543-71'    ,
'40ХН ГОСТ 4543-71'     ,
'40ХН ГОСТ 4543-71'    ,
'40ХФА ГОСТ 4543-71'    ,
'40ХФА ГОСТ 4543-71'   ,
'40ХФА ГОСТ 4543-71'   ,
'40ХФА ГОСТ 4543-71'   ,
'40ХН2МА ГОСТ 4543-71' ,
'40ХН2МА ГОСТ 4543-71'  ,
'40ХН2МА ГОСТ 4543-71'  ,
'40ХН2МА ГОСТ 4543-71' ,
'40ХН2МА ГОСТ 4543-71'  ,
'45 ГОСТ 1050-74'      ,
'45 ГОСТ 1050-74'       ,
'50ХН ГОСТ 1050-74');

// Предел текучести материала шестерни и колеса
const Sigma_ta :array[1..52] of Integer =
(600,800,850,750,800,800,750,800,630,630,800,760,700,750,750,
900,1100,1100,1200,800,1000,1200,1100,1000,400,340,650,330,1100,1100,
1100,1100,650,460,1100,1100,1000,1000,650,460,1100,1100,700,650,1300,
1000,920,450,360,1100,{min элемент}330,{max элемент}1300);
{когда меняем массив, то последнии 2 элемента меняем на минимальный и максимальный элемент в новом массиве}

// Предел выносливости по изгибу для шестерни и колеса
const Sigma_Flim0a :array[1..52] of Integer =
(950,950,820,950,820,680,820,780,820,950,950,950,780,820,780,
820,820,820,680,1000,750,750,580,480,420,330,500,330,580,460,
580,480,420,330,580,500,680,580,420,330,580,460,420,330,580,
680,580,240,330,500,{min элемент}240,{max элемент}1000);
{когда меняем массив, то последнии 2 элемента меняем на минимальный и максимальный элемент в новом массиве}

// Предельное напряжение для шестерни и колеса
const Sigma_Fst0a :array[1..52] of Integer =
(2800,2800,2800,2800,2000,2000,2800,2800,2000,2800,2800,2800,2800,2800,2800,
2000,2000,2000,2000,2500,2200,2200,1800,2250,1500,1200,1800,1200,2250,2250,
1800,2250,1500,1200,2250,2250,1800,2250,1500,1200,2250,2250,1500,1200,2500,
2200,2500,1500,1200,2250,{min элемент}1200,{max элемент}2800);
{когда меняем массив, то последнии 2 элемента меняем на минимальный и максимальный элемент в новом массиве}

// Коэффициент выносливости по изгибу для шестерни и колеса
const S_Fa :array[1..52] of Extended =
(1.55,1.55,1.55,1.55,1.55,1.70,1.55,1.70,1.55,1.55,1.55,1.55,1.70,1.55,1.70,
1.55,1.55,1.55,1.70,1.55,1.55,1.55,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,
1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,
1.70,1.70,1.70,1.70,1.70,{min элемент}1.55,{max элемент}1.70);
{когда меняем массив, то последнии 2 элемента меняем на минимальный и максимальный элемент в новом массиве}

{const Th :array[1..50] of Integer =
(5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,6,6,
6,4,4,1,2,1,2,3,3,4,4,1,2,3,3,4,4,1,2,3,3,
1,2,3,4,4,1,2,3);

const cc :array[1..50] of Integer =
(1,1,1,1,1,3,1,3,1,1,1,1,3,1,3,1,1,1,3,1,1,1,2,
2,2,2,2,2,2,3,2,2,2,2,2,3,2,2,2,2,2,3,2,2,2,2,2,2,2,3);

const H_HB :array[1..50] of Integer =
(60,60,60,60,60,59,60,59,60,60,60,60,60,60,60,60,60,60,
59,60,60,60,53,53,240,190,285,190,50,50,53,53,240,190,50,
50,53,53,240,190,50,50,240,190,50,53,53,240,190,50);

const Si :array[1..50] of Integer =
(38,38,38,38,38,38,38,38,38,38,38,38,38,38,38,38,38,38,38,38,38,38,30,53,240,190,
285,190,285,285,30,53,240,190,50,50,30,30,240,190,50,50,240,190,50,30,53,240,190,50);

const Y_g :array[1..50] of Extended =
(0.75,0.75,0.75,0.75,0.75,0.80,0.75,0.80,0.75,0.75,0.75,0.75,0.80,0.75,0.80,0.75,0.75,
0.75,0.80,0.70,0.75,0.75,1.00,1.00,1.10,1.10,1.10,1.10,0.90,1.00,1.00,1.00,1.10,1.10,
0.90,1.00,1.00,1.00,1.10,1.10,0.90,1.00,1.10,1.10,1.00,1.00,1.00,1.10,1.10,1.00);

const Y_d :array[1..50] of Extended =
(1.00,1.00,1.10,1.00,1.10,1.20,1.10,1.20,1.10,1.00,1.00,1.00,1.20,1.10,1.20,1.10,1.10,
1.10,1.20,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,
1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00);}

implementation

end.


